### 판다스(Pandas) 03  Page 2

In [3]:
import pandas as pd

df1 = pd.read_csv("data/LEC_03_data.csv")

df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [4]:
# 첫 행부터 인덱스 2 행 (3-1) 까지 
df1[:3]

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer

In [5]:
# 인덱스 3행 부터 4행 까지
df1[3:5]

   Name Country  Age        Job
3  Sato   Japan   40       Chef
4   Lee   Korea   36  Professor

In [6]:
# 인덱스 4행 부터 끝까지
df1[4:]

    Name Country  Age        Job
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [7]:
# 0 행 데이터
df1.loc[0]  # Series 리턴

Name          John
Country        USA
Age             31
Job        Student
Name: 0, dtype: object

In [8]:
# 0 행, 3행 데이터
df1.loc[ [0, 3] ]  # DataFrame 리턴

   Name Country  Age      Job
0  John     USA   31  Student
3  Sato   Japan   40     Chef

In [9]:
# 1행, 2행, 5행 데이터
df1.loc[ [1, 2, 5] ]

    Name Country  Age        Job
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
5  Smith     USA   55        CEO

## 판다스(Pandas) 03  Page 3

In [10]:
import pandas as pd

df1 = pd.read_csv("data/LEC_03_data.csv")

df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [11]:
# 하나의 열 데이터 추출
df1['Country']  # Series 타입 리턴

0       USA
1    France
2     Korea
3     Japan
4     Korea
5       USA
Name: Country, dtype: object

In [12]:
# 하나의 열 데이터 추출
df1.Country  # Series 타입 리턴

0       USA
1    France
2     Korea
3     Japan
4     Korea
5       USA
Name: Country, dtype: object

In [13]:
# 2개의 열 데이터 추출
df1[ ['Name',  'Country'] ]

    Name Country
0   John     USA
1  Sabre  France
2    Kim   Korea
3   Sato   Japan
4    Lee   Korea
5  Smith     USA

In [14]:
# 3개의 열 데이터 추출
df1[ ['Name',  'Country', 'Job'] ]

    Name Country        Job
0   John     USA    Student
1  Sabre  France     Lawyer
2    Kim   Korea  Developer
3   Sato   Japan       Chef
4    Lee   Korea  Professor
5  Smith     USA        CEO

## 판다스(Pandas) 03  Page 4

In [15]:
df2 = pd.read_csv("data/LEC_03_data_no_header.csv", header=None) 

df2

       0       1   2          3
0   John     USA  31    Student
1  Sabre  France  33     Lawyer
2    Kim   Korea  28  Developer
3   Sato   Japan  40       Chef
4    Lee   Korea  36  Professor
5  Smith     USA  55        CEO

In [16]:
# 모든 행, 1열부터 2열까지
df2.iloc[ :, 1: 3 ]

        1   2
0     USA  31
1  France  33
2   Korea  28
3   Japan  40
4   Korea  36
5     USA  55

In [17]:
# 1행부터 3행, 2열부터 끝까지
df2.iloc[ 1:4, 2: ]

    2          3
1  33     Lawyer
2  28  Developer
3  40       Chef

In [18]:
# 모든 행, 0열, 2열, 3열
df2.iloc[ :, [0, 2, 3] ]

       0   2          3
0   John  31    Student
1  Sabre  33     Lawyer
2    Kim  28  Developer
3   Sato  40       Chef
4    Lee  36  Professor
5  Smith  55        CEO

In [20]:
# 1행 3행, 1열, 3열
df2.iloc[ [1, 3], [1, 3] ]

        1       3
1  France  Lawyer
3   Japan    Chef

## 판다스(Pandas) 03 Page 5

In [21]:
import pandas as pd

df1 = pd.read_csv("data/LEC_03_data.csv")

df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [22]:
# Country 가 Korea 인 경우
df1[ df1.Country == 'Korea' ]

  Name Country  Age        Job
2  Kim   Korea   28  Developer
4  Lee   Korea   36  Professor

In [23]:
# Age > 30 인 경우
df1[ df1.Age > 30 ]

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [24]:
# Country != 'Korea'
df1[ df1.Country != 'Korea' ]

    Name Country  Age      Job
0   John     USA   31  Student
1  Sabre  France   33   Lawyer
3   Sato   Japan   40     Chef
5  Smith     USA   55      CEO

In [25]:
# Age >= 33
df1[ df1.Age >= 33 ]

    Name Country  Age        Job
1  Sabre  France   33     Lawyer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [28]:
# Country != 'USA' & Age >= 36
df1[ (df1.Country != 'USA') & (df1.Age >= 33) ]

    Name Country  Age        Job
1  Sabre  France   33     Lawyer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor

In [29]:
# Country == Korea | Job == Chef
df1[ (df1.Country == 'Korea') | (df1.Job == 'Chef') ]

   Name Country  Age        Job
2   Kim   Korea   28  Developer
3  Sato   Japan   40       Chef
4   Lee   Korea   36  Professor

In [30]:
# Age > 30 & Job == CEO
df1[ (df1.Age > 30) | (df1.Job == 'CEO') ]

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

## 판다스(Pandas) 03  Page 6

In [33]:
df1 = pd.read_csv("data/LEC_03_data.csv")

df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [53]:
df1.filter( items = ['Name', 'Country'] )

    Name Country
0   John     USA
1  Sabre  France
2    Kim   Korea
3   Sato   Japan
4    Lee   Korea
5  Smith     USA

In [57]:
df1.filter( like = 'N' )

    Name
0   John
1  Sabre
2    Kim
3   Sato
4    Lee
5  Smith

In [50]:
# 정규식(regular expression) 사용
df1.filter( regex = 'J', axis=1 )

         Job
0    Student
1     Lawyer
2  Developer
3       Chef
4  Professor
5        CEO

In [51]:
# 정규식(regular expression) 사용
df1.filter( regex = 'y$', axis=1 )

  Country
0     USA
1  France
2   Korea
3   Japan
4   Korea
5     USA